NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
        <register>
          <name>TRCQCTLR</name>
          <description>Controls when Q elements are enabled. Might ignore writes when the trace unit is enabled or not idle. This register must be programmed if it is implemented and TRCCONFIGR.QE is set to any value other than 0b00.</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RANGE_0</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 0 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 0 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_1</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 1 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 1 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_2</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 2 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 2 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_3</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 3 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 3 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_4</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 4 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 4 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_5</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 5 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 5 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_6</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 6 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 6 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_7</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 7 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 7 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Selects whether the address range comparators selected by the RANGE field indicate
address ranges where the trace unit is permitted to generate Q elements or address ranges
where the trace unit is not permitted to generate Q elements:</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Exclude</name>
                  <description>Exclude mode. The address range comparators selected by the RANGE field
indicate address ranges where the trace unit cannot generate Q elements. If no
ranges are selected, Q elements are permitted across the entire memory map.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Include</name>
                  <description>Include mode. The address range comparators selected by the RANGE field
indicate address ranges where the trace unit can generate Q elements. If all the
implemented bits in RANGE are set to 0 then Q elements are disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCVICTLR</name>
          <description>Controls instruction trace filtering. Might ignore writes when the trace unit is enabled or not idle. Only returns stable data when TRCSTATR.PMSTABLE == 1. Must be programmed, particularly to set the value of the SSSTATUS bit, which sets the state of the start/stop logic.</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENT_SEL</name>
              <description>Select which resource number should be filtered.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>This event is not filtered.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>This event is filtered.</description>
                  <value>0x01</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSSTATUS</name>
              <description>When TRCIDR4.NUMACPAIRS &amp;gt; 0 or TRCIDR4.NUMPC &amp;gt; 0, this bit returns the status of the start/stop logic.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stopped</name>
                  <description>The start/stop logic is in the stopped state.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>The start/stop logic is in the started state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRCRESET</name>
              <description>Controls whether a trace unit must trace a Reset exception.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not trace a Reset exception unless it traces the exception or instruction immediately prior to the Reset exception.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit always traces a Reset exception.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRCERR</name>
              <description>When TRCIDR3.TRCERR==1, this bit controls whether a trace unit must trace a System error exception.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not trace a System error exception unless it traces the exception or instruction immediately prior to the System error exception.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit always traces a System error exception, regardless of the value of ViewInst.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL0_S</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 0.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Secure state, for Exception level 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Secure state, for Exception level 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL1_S</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 1.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Secure state, for Exception level 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Secure state, for Exception level 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL2_S</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 2.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Secure state, for Exception level 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Secure state, for Exception level 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL3_S</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 3.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Secure state, for Exception level 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Secure state, for Exception level 3.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL0_NS</name>
              <description>In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 0.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Non-secure state, for Exception level 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Non-secure state, for Exception level 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL1_NS</name>
              <description>In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 1.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Non-secure state, for Exception level 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Non-secure state, for Exception level 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL2_NS</name>
              <description>In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 2.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Non-secure state, for Exception level 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Non-secure state, for Exception level 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL3_NS</name>
              <description>In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 3.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Non-secure state, for Exception level 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Non-secure state, for Exception level 3.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
