NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
        <register>
          <name>DEVTYPE</name>
          <description>Device Type Identifier Register</description>
          <addressOffset>0xFCC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000021</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAJOR_TYPE</name>
              <description>Major classification grouping for this debug/trace component</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SUB_TYPE</name>
              <description>Sub-classification within the major category</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID4</name>
          <description>Peripheral ID4 Register</description>
          <addressOffset>0xFD0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DES_2</name>
              <description>JEDEC continuation code indicating the designer of the component (along with the identity code)</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SIZE</name>
              <description>This is a 4-bit value that indicates the total contiguous size of the memory window used by this component in powers of 2 from the standard 4KB. If a component only requires the standard 4KB then this should read as 0x0, 4KB only, for 8KB set to 0x1, 16KB == 0x2, 32KB == 0x3, and so on.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID0</name>
          <description>Peripheral ID0 Register</description>
          <addressOffset>0xFE0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000007</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PART_0</name>
              <description>Bits [7:0] of the component's part number. This is selected by the designer of the component.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID1</name>
          <description>Peripheral ID1 Register</description>
          <addressOffset>0xFE4</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B9</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PART_1</name>
              <description>Bits [11:8] of the component's part number. This is selected by the designer of the component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DES_0</name>
              <description>Bits 3:0 of the JEDEC identity code indicating the designer of the component (along with the continuation code)</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID2</name>
          <description>Peripheral ID2 Register</description>
          <addressOffset>0xFE8</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000004B</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DES_1</name>
              <description>Bits 6:4 of the JEDEC identity code indicating the designer of the component (along with the continuation code)</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>JEDEC</name>
              <description>Always set. Indicates that a JEDEC assigned value is used</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>REVISION</name>
              <description>The Revision field is an incremental value starting at 0x0 for the first design of this component. This only increases by 1 for both major and minor revisions and is simply used as a look-up to establish the exact major/minor revision.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHID3</name>
          <description>Peripheral ID3 Register</description>
          <addressOffset>0xFEC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMOD</name>
              <description>Where the component is reusable IP, this value indicates if the customer has modified the behavior of the component. In most cases this field is zero.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>REVAND</name>
              <description>This field indicates minor errata fixes specific to this design, for example metal fixes after implementation. In most cases this field is zero. It is recommended that component designers ensure this field can be changed by a metal fix if required, for example by driving it from registers that reset to zero.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID0</name>
          <description>Component ID0 Register</description>
          <addressOffset>0xFF0</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>Contains bits [7:0] of the component identification</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID1</name>
          <description>Component ID1 Register</description>
          <addressOffset>0xFF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000090</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_1</name>
              <description>Contains bits [11:8] of the component identification</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CLASS</name>
              <description>Class of the component. E. g. ROM table, CoreSight component etc. Constitutes bits [15:12] of the component identification.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID2</name>
          <description>Component ID2 Register</description>
          <addressOffset>0xFF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>Contains bits [23:16] of the component identification</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID3</name>
          <description>Component ID3 Register</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>Contains bits [31:24] of the component identification</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
