NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
        <register>
          <name>ITATBCTR2</name>
          <description>The ITATBCTR2 register performs different functions depending on whether the access is a read or a write.</description>
          <addressOffset>0xEF0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATREADY</name>
              <description>A read access returns the value of atreadym.
        A write access outputs the data to afvalids[n], where the value of the CTRLREG at 0x000 defines n.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFVALID</name>
              <description>A read access returns the value of afvalidm.
        A write access outputs the data to atreadys[n], where the value of the CTRLREG at 0x000 defines n.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR1</name>
          <description>The ITATBCTR1 register performs different functions depending on whether the access is a read or a write.</description>
          <addressOffset>0xEF4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATVALIDM0</name>
              <description>A read returns the value of the atids[n] signals, where the value of the Control Register at 0x000 defines n.
A write outputs the value to the atidm port.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x01</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR0</name>
          <description>The ITATBCTR0 register performs different functions depending on whether the access is a read or a write.</description>
          <addressOffset>0xEF8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATVALID</name>
              <description>A read returns the value of the atvalids[n] signal, where the value of the CTRLREG at 0x000 defines n.
A write outputs the value to atvalidm.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFREADY</name>
              <description>A read returns the value of the afreadys[n] signal, where the value of the Ctrl_Reg at 0x000 defines n.
A write outputs the value to afreadym.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATBYTES</name>
              <description>A read returns the value of the atbytess[n] signal, where the value of the Ctrl_Reg at 0x000 defines n.
A write outputs the value to atbytesm.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCTRL</name>
          <description>The ITCTRL register enables the component to switch from a functional mode, which is the default behavior, 
      to integration mode where the inputs and outputs of the component can be directly controlled for the purposes of integration testing and topology detection.</description>
          <addressOffset>0xF00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IME</name>
              <description>Integration Mode Enable.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Integration mode disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Integration mode enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMSET</name>
          <description>Software can use the claim tag to coordinate application and debugger access to trace unit functionality. 
      The claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the claim tag, and determines the number of claim bits implemented.</description>
          <addressOffset>0xFA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_0</name>
              <description>Set claim bit 0 and check if bit is implemented or not.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>Claim bit 0 is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim bit 0 is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set claim bit 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_1</name>
              <description>Set claim bit 1 and check if bit is implemented or not.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>Claim bit 1 is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim bit 1 is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set claim bit 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_2</name>
              <description>Set claim bit 2 and check if bit is implemented or not.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>Claim bit 2 is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim bit 2 is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set claim bit 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_3</name>
              <description>Set claim bit 3 and check if bit is implemented or not.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>Claim bit 3 is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim bit 3 is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set claim bit 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <description>Software can use the claim tag to coordinate application and debugger access to trace unit functionality. 
      The claim tags have no effect on the operation of the component. 
      The CLAIMCLR register sets the bits in the claim tag to 0 and determines the current value of the claim tag.</description>
          <addressOffset>0xFA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_0</name>
              <description>Read or clear claim bit 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Cleared</name>
                  <description>Claim bit 0 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim bit 0 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim bit 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_1</name>
              <description>Read or clear claim bit 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Cleared</name>
                  <description>Claim bit 1 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim bit 1 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim bit 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_2</name>
              <description>Read or clear claim bit 2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Cleared</name>
                  <description>Claim bit 2 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim bit 2 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim bit 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_3</name>
              <description>Read or clear claim bit 3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Cleared</name>
                  <description>Claim bit 3 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim bit 3 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim bit 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LAR</name>
          <description>This is used to enable write access to device registers.</description>
          <addressOffset>0xFB0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCESS</name>
              <description>A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UnLock</name>
                  <description>Unlock register interface.</description>
                  <value>0xC5ACCE55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LSR</name>
          <description>This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under debug. 
      Accesses to the extended stimulus port registers are not affected by the lock mechanism. 
      This register must always be present although there might not be any lock access control mechanism. 
      The lock mechanism, where present and locked, must block write accesses to any control register, except the Lock Access Register. 
      For most components this covers all registers except for the Lock Access Register.</description>
          <addressOffset>0xFB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRESENT</name>
              <description>Indicates that a lock control mechanism exists for this device.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>No lock control mechanism exists, writes to the Lock Access Register are ignored.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Lock control mechanism is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKED</name>
              <description>Returns the current status of the Lock.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UnLocked</name>
                  <description>Write access is allowed to this device.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Write access to the component is blocked. All writes to control registers are ignored. Reads are permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TYPE</name>
              <description>Indicates if the Lock Access Register is implemented as 8-bit or 32-bit.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Bits32</name>
                  <description>This component implements a 32-bit Lock Access Register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bits8</name>
                  <description>This component implements an 8-bit Lock Access Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
