NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="IPC_NS">
      <name>IPC_S</name>
      <description>Interprocessor communication 1</description>
      <baseAddress>0x5002A000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>IPC</name>
        <value>42</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>FPU_NS</name>
      <description>FPU</description>
      <baseAddress>0x4002C000</baseAddress>
      <headerStructName>FPU</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FPU</name>
        <value>44</value>
      </interrupt>
      <groupName>FPU</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOTE0_S">
      <name>GPIOTE1_NS</name>
      <description>GPIO Tasks and Events 1</description>
      <baseAddress>0x40031000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>GPIOTE1</name>
        <value>49</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>APPROTECT_NS</name>
      <description>Access Port Protection 0</description>
      <baseAddress>0x40039000</baseAddress>
      <headerStructName>APPROTECT</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>APPROTECT</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>SECUREAPPROTECT</name>
          <description>Unspecified</description>
          <headerStructName>APPROTECT_SECUREAPPROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0xE00</addressOffset>
          <register>
            <name>DISABLE</name>
            <description>Software disable SECUREAPPROTECT mechanism</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <!--Security securemapping=S-->
            <fields>
              <field>
                <name>DISABLE</name>
                <description>Software disable SECUREAPPROTECT mechanism</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SwUnprotected</name>
                    <description>Software disable SECUREAPPROTECT mechanism</description>
                    <value>0x5A</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEPROTECT</name>
            <description>Software force SECUREAPPROTECT mechanism</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <alternateRegister>DISABLE</alternateRegister>
            <size>0x20</size>
            <!--Security securemapping=S-->
            <fields>
              <field>
                <name>FORCEPROTECT</name>
                <description>Write 0x1 to force enable SECUREAPPROTECT mechanism</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Force</name>
                    <description>Software force enable SECUREAPPROTECT mechanism</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>APPROTECT</name>
          <description>Unspecified</description>
          <headerStructName>APPROTECT_APPROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0xE10</addressOffset>
          <register>
            <name>DISABLE</name>
            <description>Software disable APPROTECT mechanism</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <!--Security securemapping=NS-->
            <fields>
              <field>
                <name>DISABLE</name>
                <description>Software disable APPROTECT mechanism</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SwUnprotected</name>
                    <description>Software disable APPROTECT mechanism</description>
                    <value>0x5A</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEPROTECT</name>
            <description>Software force APPROTECT mechanism</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <alternateRegister>DISABLE</alternateRegister>
            <size>0x20</size>
            <!--Security securemapping=NS-->
            <fields>
              <field>
                <name>FORCEPROTECT</name>
                <description>Write 0x1 to force enable APPROTECT mechanism</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Force</name>
                    <description>Software force enable APPROTECT mechanism</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
