NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="APPROTECT_NS">
      <name>APPROTECT_S</name>
      <description>Access Port Protection 1</description>
      <baseAddress>0x50039000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="KMU_NS">
      <name>KMU_S</name>
      <description>Key management unit 1</description>
      <baseAddress>0x50039000</baseAddress>
      <alternatePeripheral>APPROTECT_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <!--Split access-->
      <interrupt>
        <name>KMU</name>
        <value>57</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="NVMC_NS">
      <name>NVMC_S</name>
      <description>Non-volatile memory controller 1</description>
      <baseAddress>0x50039000</baseAddress>
      <alternatePeripheral>APPROTECT_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <!--Split access-->
    </peripheral>
    <peripheral>
      <name>VMC_NS</name>
      <description>Volatile Memory controller 0</description>
      <baseAddress>0x4003A000</baseAddress>
      <headerStructName>VMC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>VMC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>RAM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>VMC_RAM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>POWER</name>
            <description>Description cluster: RAMn power control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>S0POWER</name>
                <description>Keep RAM section S0 of RAM n on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1POWER</name>
                <description>Keep RAM section S1 of RAM n on or off in System ON mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S2POWER</name>
                <description>Keep RAM section S2 of RAM n on or off in System ON mode</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S3POWER</name>
                <description>Keep RAM section S3 of RAM n on or off in System ON mode</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0RETENTION</name>
                <description>Keep retention on RAM section S0 of RAM n when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1RETENTION</name>
                <description>Keep retention on RAM section S1 of RAM n when RAM section is switched off</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S2RETENTION</name>
                <description>Keep retention on RAM section S2 of RAM n when RAM section is switched off</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S3RETENTION</name>
                <description>Keep retention on RAM section S3 of RAM n when RAM section is switched off</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERSET</name>
            <description>Description cluster: RAMn power control set register</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>S0POWER</name>
                <description>Keep RAM section S0 of RAM n on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1POWER</name>
                <description>Keep RAM section S1 of RAM n on or off in System ON mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S2POWER</name>
                <description>Keep RAM section S2 of RAM n on or off in System ON mode</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S3POWER</name>
                <description>Keep RAM section S3 of RAM n on or off in System ON mode</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0RETENTION</name>
                <description>Keep retention on RAM section S0 of RAM n when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1RETENTION</name>
                <description>Keep retention on RAM section S1 of RAM n when RAM section is switched off</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S2RETENTION</name>
                <description>Keep retention on RAM section S2 of RAM n when RAM section is switched off</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S3RETENTION</name>
                <description>Keep retention on RAM section S3 of RAM n when RAM section is switched off</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERCLR</name>
            <description>Description cluster: RAMn power control clear register</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>S0POWER</name>
                <description>Keep RAM section S0 of RAM n on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1POWER</name>
                <description>Keep RAM section S1 of RAM n on or off in System ON mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S2POWER</name>
                <description>Keep RAM section S2 of RAM n on or off in System ON mode</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S3POWER</name>
                <description>Keep RAM section S3 of RAM n on or off in System ON mode</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0RETENTION</name>
                <description>Keep retention on RAM section S0 of RAM n when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1RETENTION</name>
                <description>Keep retention on RAM section S1 of RAM n when RAM section is switched off</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S2RETENTION</name>
                <description>Keep retention on RAM section S2 of RAM n when RAM section is switched off</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S3RETENTION</name>
                <description>Keep retention on RAM section S3 of RAM n when RAM section is switched off</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
