NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="VMC_NS">
      <name>VMC_S</name>
      <description>Volatile Memory controller 1</description>
      <baseAddress>0x5003A000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>CRYPTOCELL_S</name>
      <description>CRYPTOCELL register interface</description>
      <baseAddress>0x50840000</baseAddress>
      <headerStructName>CRYPTOCELL</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CRYPTOCELL</name>
        <value>64</value>
      </interrupt>
      <groupName>CRYPTOCELL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>ENABLE</name>
          <description>Enable CRYPTOCELL subsystem.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable the CRYPTOCELL subsystem.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRYPTOCELL subsystem disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>CRYPTOCELL subsystem enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_AES_S</name>
      <description>CRYPTOCELL AES engine</description>
      <baseAddress>0x50841000</baseAddress>
      <headerStructName>CC_AES</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_AES</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>AES_KEY_0[%s]</name>
          <description>Description collection: AES key value to use.
        The initial AES_KEY_0[0] register holds the least significant bits [31:0] of the key value.</description>
          <addressOffset>0x400</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>AES key value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>AES_IV_0[%s]</name>
          <description>Description collection: AES Initialization Vector (IV) to use.
        The initial AES_IV_0[0] register holds the least significant bits [31:0] of the IV.</description>
          <addressOffset>0x440</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>AES non-tunneling or first tunnel stage IV value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>AES_CTR[%s]</name>
          <description>Description collection: AES counter (CTR) to use.
        The initial AES_CTR[0] register holds the least significant bits [31:0] of the CTR.</description>
          <addressOffset>0x460</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>AES CTR value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_BUSY</name>
          <description>Status register for AES engine activity.</description>
          <addressOffset>0x470</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>AES engine status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>AES engine is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>AES engine is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_SK</name>
          <description>Writing to this address trigger sampling of the HW key to the AES_KEY_0 register</description>
          <addressOffset>0x478</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AES_SK</name>
              <description>Sample HW key to AES_KEY_0 registers.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CMAC_INIT</name>
          <description>Writing to this address triggers the AES engine to generate K1 and K2 for AES-CMAC operations.</description>
          <addressOffset>0x47C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Generate K1 and K2 for the AES-CMAC operations.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Initialize AES-CMAC operations.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_REMAINING_BYTES</name>
          <description>This register should be set with the amount of remaining bytes until the end of the current AES operation.</description>
          <addressOffset>0x4BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Remaining bytes util the end of the current AES operation.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CONTROL</name>
          <description>Control the AES engine behavior.</description>
          <addressOffset>0x4C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEC_KEY0</name>
              <description>Set AES encrypt or decrypt mode in non-tunneling operations.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Encrypt</name>
                  <description>Perform AES encryption</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Decrypt</name>
                  <description>Perform AES decryption</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE_KEY0</name>
              <description>Set the AES mode.</description>
              <lsb>2</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>Electronic codebook mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>Cipher block chaining mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTR</name>
                  <description>Counter mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC_MAC</name>
                  <description>Cipher Block Chaining Message Authentication Code</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMAC</name>
                  <description>Cipher-based Message Authentication Code</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NK_KEY0</name>
              <description>Set the AES key length.</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128Bits</name>
                  <description>128 bits key length</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_XOR_CRYPTOKEY</name>
              <description>This field determines the value that is written to AES_KEY_0, when AES_SK is kicked.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>The value that is written to AES_KEY_0 is the value of the HW cryptokey as is.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>The value that is written to AES_KEY_0 is the value of the HW cryptokey XOR with the current value of AES_KEY_0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRECT_ACCESS</name>
              <description>Using direct access and not the DIN-DOUT DMA interface</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Access using the DIN-DOUT DMA interface</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Access using direct access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_HW_FLAGS</name>
          <description>Hardware configuration of the AES engine. Reset value holds the supported features.</description>
          <addressOffset>0x4C8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000108</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SUPPORT_256_192_KEY</name>
              <description>If this flag is set, the engine support 192 bits and 256 bits key size.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AES_LARGE_RKEK</name>
              <description>If this flag is set, the engine support AES_LARGE_RKEK.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DPA_CNTRMSR_EXIST</name>
              <description>If this flag is set, the engine support DPA countermeasures.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CTR_EXIST</name>
              <description>If this flag is set, the engine support AES CTR mode.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ONLY_ENCRYPT</name>
              <description>If this flag is set, the engine only support encrypt operations.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>USE_SBOX_TABLE</name>
              <description>If this flag is set, the engine uses SBOX tables.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>USE_5_SBOXES</name>
              <description>If this flag is set, the engine uses 5 SBOX where each AES round takes 4 cycles.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>AES_SUPPORT_PREV_IV</name>
              <description>If this flag is set, the engine contains the PREV_IV register for faster AES XCBC MAC calculation.</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>AES_TUNNEL_EXIST</name>
              <description>If this flag is set, the engine support tunneling operations.</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>SECOND_REGS_SET_EXIST</name>
              <description>If this flag is set, the engine support a second register set for tunneling operations.</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>DFA_CNTRMSR_EXIST</name>
              <description>If this flag is set, the engine support DFA countermeasures.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CTR_NO_INCREMENT</name>
          <description>This register enables the AES CTR no increment mode in which the counter mode is not incremented between two blocks</description>
          <addressOffset>0x4D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>This field enables the AES CTR no increment mode in which the counter mode is not incremented between two blocks</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Counter always incremented between blocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Do not increment counter between blocks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_SW_RESET</name>
          <description>Reset the AES engine.</description>
          <addressOffset>0x4F4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing any value to this address resets the AES engine. The reset takes 4 CPU clock cycles to complete.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset AES engine.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CMAC_SIZE0_KICK</name>
          <description>Writing to this address triggers the AES engine to perform a CMAC operation with size 0. The CMAC result can be read from the AES_IV_0 register.</description>
          <addressOffset>0x524</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Force AES CMAC operation with size 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Normal AES CMAC operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Force CMAC operation with size 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
