NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_AHB_S</name>
      <description>CRYPTOCELL AHB interface</description>
      <baseAddress>0x50841000</baseAddress>
      <alternatePeripheral>CC_AES_S</alternatePeripheral>
      <headerStructName>CC_AHB</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_AHB</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>AHBM_SINGLES</name>
          <description>This register forces the AHB transactions from CRYPTOCELL master to be always singles.</description>
          <addressOffset>0xB00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHB_SINGLES</name>
              <description>Force AHB singles</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBM_HPROT</name>
          <description>This register holds the AHB HPROT value</description>
          <addressOffset>0xB04</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHB_HPROT</name>
              <description>The AHB HPROT value</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBM_HMASTLOCK</name>
          <description>This register holds AHB HMASTLOCK value</description>
          <addressOffset>0xB08</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHB_HMASTLOCK</name>
              <description>The AHB HMASTLOCK value.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBM_HNONSEC</name>
          <description>This register holds AHB HNONSEC value</description>
          <addressOffset>0xB0C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHB_WRITE_HNONSEC</name>
              <description>The AHB HNONSEC value for write transaction.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AHB_READ_HNONSEC</name>
              <description>The AHB HNONSEC value for read transaction.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_CHACHA_S</name>
      <description>CRYPTOCELL CHACHA engine</description>
      <baseAddress>0x50841000</baseAddress>
      <alternatePeripheral>CC_AES_S</alternatePeripheral>
      <headerStructName>CC_CHACHA</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_CHACHA</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CHACHA_CONTROL</name>
          <description>Control the CHACHA engine behavior.</description>
          <addressOffset>0x380</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHACHA_OR_SALSA</name>
              <description>Run engine in ChaCha or Salsa mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ChaCha</name>
                  <description>Run engine in ChaCha mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Salsa</name>
                  <description>Run engine in Salsa mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INIT</name>
              <description>Perform initialization for a new message</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Message already initialized</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Initialize new message</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GEN_KEY_POLY1305</name>
              <description>Generate the key to use in Poly1305 message authentication code calculation.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not generate Poly1305 key</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Generate Poly1305 key</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY_LEN</name>
              <description>Key length selection.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256Bits</name>
                  <description>Use 256 bits key length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128Bits</name>
                  <description>Use 128 bits key length</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUM_OF_ROUNDS</name>
              <description>Set number of permutation rounds, default value is 20.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Use 20 rounds of rotation (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12Rounds</name>
                  <description>Use 12 rounds of rotation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8Rounds</name>
                  <description>Use 8 rounds of rotation</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET_BLOCK_CNT</name>
              <description>Reset block counter for new messages</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Use current block counter value</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset block counter value to zero</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USE_IV_96BIT</name>
              <description>Use 96 bits Initialization Vector (IV)</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Use default size IV of 64 bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>The IV is 96 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHA_VERSION</name>
          <description>CHACHA engine HW version</description>
          <addressOffset>0x384</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHACHA_VERSION</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CHACHA_KEY[%s]</name>
          <description>Description collection: CHACHA key value to use. The initial CHACHA_KEY[0] register holds the least significant bits [31:0] of the key value.</description>
          <addressOffset>0x388</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>CHACHA key value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CHACHA_IV[%s]</name>
          <description>Description collection: CHACHA Initialization Vector (IV) to use. The IV is also known as the nonce.</description>
          <addressOffset>0x3A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>CHACHA IV value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHA_BUSY</name>
          <description>Status register for CHACHA engine activity.</description>
          <addressOffset>0x3B0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>CHACHA engine status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>CHACHA engine is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>CHACHA engine is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHA_HW_FLAGS</name>
          <description>Hardware configuration of the CHACHA engine. Reset value holds the supported features.</description>
          <addressOffset>0x3B4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHACHA_EXISTS</name>
              <description>If this flag is set, the engine include ChaCha support</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>SALSA_EXISTS</name>
              <description>If this flag is set, the engine include Salsa support</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FAST_CHACHA</name>
              <description>If this flag is set, the next matrix calculated when the current one is written to data output path.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHA_BLOCK_CNT_LSB</name>
          <description>Store the LSB value of the block counter, in order to support suspend/resume of operation</description>
          <addressOffset>0x3B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>This register holds the ChaCha block counter bits [31:0] and must be read and written during respectively suspend and resume operations.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHA_BLOCK_CNT_MSB</name>
          <description>Store the MSB value of the block counter, in order to support suspend/resume of operation</description>
          <addressOffset>0x3BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>This register holds the ChaCha block counter bits [63:32] and must be read and written during respectively suspend and resume operations.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHA_SW_RESET</name>
          <description>Reset the CHACHA engine.</description>
          <addressOffset>0x3C0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing any value to this address resets the CHACHA engine. The reset takes 4 CPU clock cycles to complete.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset CHACHA engine.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CHACHA_POLY1305_KEY[%s]</name>
          <description>Description collection: The auto-generated key to use in Poly1305 MAC calculation. The initial CHACHA_POLY1305_KEY[0] register holds the least significant bits [31:0] of the key value.</description>
          <addressOffset>0x3C4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Poly1305 key value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHA_ENDIANNESS</name>
          <description>CHACHA engine data order configuration.</description>
          <addressOffset>0x3E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHACHA_DIN_WORD_ORDER</name>
              <description>Change the word order of the input data.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Use default word order for 128-bits input, where words are ordered as follows: w0, w1, w2, w3.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reverse</name>
                  <description>Reverses the word order for 128-bits input, where words are re-ordered as follows: w3, w2, w1, w0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHACHA_DIN_BYTE_ORDER</name>
              <description>Change the byte order of the input data.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Use default byte order within each input word, where bytes are ordered as follows: B0, B1, B2, B3.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reverse</name>
                  <description>Reverse the byte order within each input word, where bytes are re-ordered as follows: B3, B2, B1, B0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHACHA_CORE_MATRIX_LBE_ORDER</name>
              <description>Change the quarter of a matrix order in the engine.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Use default quarter of matrix order, where quarters are ordered as follows: q0, q1, q2, q3. Each quarter represents a 128-bits section of the matrix.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reverse</name>
                  <description>Reverse the order of matrix quarters, where quarters are re-ordered as follows: q3, q2, q1, q0. Each quarter represents a 128-bits section of the matrix.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHACHA_DOUT_WORD_ORDER</name>
              <description>Change the word order of the output data.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Uses default word order for 128-bits output, where words are ordered as follows: w0, w1, w2, w3.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reverse</name>
                  <description>Reverse the word order for 128-bits output, where words are re-ordered as follows: w3, w2, w1, w0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHACHA_DOUT_BYTE_ORDER</name>
              <description>Change the byte order of the output data.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Use default byte order within each output word, where bytes are ordered as follows: B0, B1, B2, B3.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reverse</name>
                  <description>Reverse the byte order within each output word, where bytes are re-ordered as follows: B3, B2, B1, B0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHA_DEBUG</name>
          <description>Debug register for the CHACHA engine</description>
          <addressOffset>0x3E8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSM_STATE</name>
              <description>Reflects the debug state of the CHACHA FSM.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE_STATE</name>
                  <description>CHACHA FSM is in idle state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT_STATE</name>
                  <description>CHACHA FSM is in init state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROUNDS_STATE</name>
                  <description>CHACHA FSM is in rounds state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINAL_STATE</name>
                  <description>CHACHA FSM is in final state</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
