NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_CTL_S</name>
      <description>CRYPTOCELL CTL interface</description>
      <baseAddress>0x50841000</baseAddress>
      <alternatePeripheral>CC_AES_S</alternatePeripheral>
      <headerStructName>CC_CTL</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_CTL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CRYPTO_CTL</name>
          <description>Defines the cryptographic flow.</description>
          <addressOffset>0x900</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Configure the cryptographic engine mode.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass cryptographic engine</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESActive</name>
                  <description>Use AES engine</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESToHashActive</name>
                  <description>Pipe AES engine output to HASH engine input</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESAndHashActive</name>
                  <description>Process input using both AES and HASH engine in parallell</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HashActive</name>
                  <description>Use HASH engine</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESMACAndBypassActive</name>
                  <description>Calculate AES MAC and bypass</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESToHashAndDOUTActive</name>
                  <description>Pipe AES engine output to HASH engine input. The resulting digest output is piped to DOUT buffer.</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ChaChaActive</name>
                  <description>Use CHACHA engine</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPTO_BUSY</name>
          <description>Status register for cryptographic cores engine activity.</description>
          <addressOffset>0x910</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Cryptographic core engines status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Cryptographic core engines are idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Cryptographic core engines are busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_BUSY</name>
          <description>Status register for HASH engine activity.</description>
          <addressOffset>0x91C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Hash engine status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>HASH engine is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>HASH engine is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTEXT_ID</name>
          <description>A general-purpose read/write register.</description>
          <addressOffset>0x930</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CONTEXT_ID</name>
              <description>Context ID</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_DIN_S</name>
      <description>CRYPTOCELL Data IN interface</description>
      <baseAddress>0x50841000</baseAddress>
      <alternatePeripheral>CC_AES_S</alternatePeripheral>
      <headerStructName>CC_DIN</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_DIN</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>DIN_BUFFER</name>
          <description>Used by CPU to write data directly to the DIN buffer, which is then sent to the cryptographic engines for processing.</description>
          <addressOffset>0xC00</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>This register is mapped into 8 addresses in order to enable a CPU burst.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN_DMA_MEM_BUSY</name>
          <description>Status register for DIN DMA engine activity when accessing memory.</description>
          <addressOffset>0xC20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>DIN memory DMA engine status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>DIN memory DMA engine is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>DIN memory DMA engine is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_MEM_ADDR</name>
          <description>Data source address in memory.</description>
          <addressOffset>0xC28</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Source address in memory.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_MEM_SIZE</name>
          <description>The number of bytes to be read from memory. Writing to this register triggers the DMA operation.</description>
          <addressOffset>0xC2C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Total number of bytes to read from memory.</description>
              <lsb>0</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>FIRST</name>
              <description>This field is reserved</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>LAST</name>
              <description>This field is reserved</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_SRAM_ADDR</name>
          <description>Data source address in RNG SRAM.</description>
          <addressOffset>0xC30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Source address in RNG SRAM.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_SRAM_SIZE</name>
          <description>The number of bytes to be read from RNG SRAM. Writing to this register triggers the DMA operation.</description>
          <addressOffset>0xC34</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Total number of bytes to read from RNG SRAM.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN_DMA_SRAM_BUSY</name>
          <description>Status register for DIN DMA engine activity when accessing RNG SRAM.</description>
          <addressOffset>0xC38</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>DIN RNG SRAM DMA engine status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>DIN RNG SRAM DMA engine is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>DIN RNG SRAM DMA engine is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN_DMA_SRAM_ENDIANNESS</name>
          <description>Configure the endianness of DIN DMA transactions towards RNG SRAM.</description>
          <addressOffset>0xC3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENDIAN</name>
              <description>Endianness of DIN DMA transactions towards RNG SRAM. The default value is little-endian.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LittleEndian</name>
                  <description>Use little-endian format for RNG SRAM DMA transactions</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BigEndian</name>
                  <description>Use big-endian format for RNG SRAM DMA transactions</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN_SW_RESET</name>
          <description>Reset the DIN DMA engine.</description>
          <addressOffset>0xC44</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing any value to this address resets the DIN DMA engine. The reset takes 4 CPU clock cycles to complete.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset DIN DMA engine.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN_CPU_DATA</name>
          <description>Specifies the number of bytes the CPU will write to the DIN_BUFFER, ensuring the cryptographic engine processes the correct amount of data.</description>
          <addressOffset>0xC48</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>When using CPU direct write to the DIN_BUFFER, the size of input data in bytes should be written to this register.</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN_WRITE_ALIGN</name>
          <description>Indicates that the next CPU write to the DIN_BUFFER is the last in the sequence. This is needed only when the data size is NOT modulo 4 (e.g. HASH padding).</description>
          <addressOffset>0xC4C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LAST</name>
              <description>Next CPU write to the DIN_BUFFER is the last word.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Confirm</name>
                  <description>The next CPU write is the last in the sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN_FIFO_EMPTY</name>
          <description>Register indicating if DIN FIFO is empty and if more data can be accepted.</description>
          <addressOffset>0xC50</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>DIN FIFO status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotEmpty</name>
                  <description>DIN FIFO is not empty</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Empty</name>
                  <description>DIN FIFO is empty, and more data can be accepted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN_FIFO_RESET</name>
          <description>Reset the DIN FIFO, effectively clearing the FIFO for new data.</description>
          <addressOffset>0xC58</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing any value to this address resets the DIN FIFO.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset DIN FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
