NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_DOUT_S</name>
      <description>CRYPTOCELL Data OUT interface</description>
      <baseAddress>0x50841000</baseAddress>
      <alternatePeripheral>CC_AES_S</alternatePeripheral>
      <headerStructName>CC_DOUT</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_DOUT</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>DOUT_BUFFER</name>
          <description>Cryptographic results directly accessible by the CPU.</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>This address can be used by the CPU to read data directly from the DOUT buffer.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT_DMA_MEM_BUSY</name>
          <description>Status register for DOUT DMA engine activity when accessing memory.</description>
          <addressOffset>0xD20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>DOUT memory DMA engine status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>DOUT memory DMA engine is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>DOUT memory DMA engine is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DST_MEM_ADDR</name>
          <description>Data destination address in memory.</description>
          <addressOffset>0xD28</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Destination address in memory.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DST_MEM_SIZE</name>
          <description>The number of bytes to be written to memory.</description>
          <addressOffset>0xD2C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Total number of bytes to write to memory.</description>
              <lsb>0</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>FIRST</name>
              <description>This field is reserved</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>LAST</name>
              <description>This field is reserved</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DST_SRAM_ADDR</name>
          <description>Data destination address in RNG SRAM.</description>
          <addressOffset>0xD30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Destination address in RNG SRAM.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DST_SRAM_SIZE</name>
          <description>The number of bytes to be written to RNG SRAM.</description>
          <addressOffset>0xD34</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Total number of bytes to write to RNG SRAM.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT_DMA_SRAM_BUSY</name>
          <description>Status register for DOUT DMA engine activity when accessing RNG SRAM.</description>
          <addressOffset>0xD38</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>DOUT RNG SRAM DMA engine status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>DOUT RNG SRAM DMA engine is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>DOUT RNG SRAM DMA engine is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT_DMA_SRAM_ENDIANNESS</name>
          <description>Configure the endianness of DOUT DMA transactions towards RNG SRAM.</description>
          <addressOffset>0xD3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENDIAN</name>
              <description>Endianness of DOUT DMA transactions towards RNG SRAM. The default value is little-endian.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LittleEndian</name>
                  <description>Use little-endian format for RNG SRAM DMA transactions</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BigEndian</name>
                  <description>Use big-endian format for RNG SRAM DMA transactions</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT_READ_ALIGN</name>
          <description>Indication that the next CPU read from the DOUT_BUFFER is the last in the sequence. This is needed only when the data size is NOT modulo 4 (e.g. HASH padding).</description>
          <addressOffset>0xD44</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LAST</name>
              <description>Next CPU read from the DOUT_BUFFER is the last word, and the remaining read aligned content can be flushed.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Flush</name>
                  <description>Flush the remaining read aligned content.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT_FIFO_EMPTY</name>
          <description>Register indicating if DOUT FIFO is empty or if more data will come.</description>
          <addressOffset>0xD50</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>DOUT FIFO status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotEmpty</name>
                  <description>DOUT FIFO is not empty, and more data will come</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Empty</name>
                  <description>DOUT FIFO is empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT_SW_RESET</name>
          <description>Reset the DOUT DMA engine.</description>
          <addressOffset>0xD58</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing any value to this address resets the DOUT DMA engine. The reset takes 4 CPU clock cycles to complete.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset DOUT DMA engine.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
