NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_HASH_S</name>
      <description>CRYPTOCELL HASH engine</description>
      <baseAddress>0x50841000</baseAddress>
      <alternatePeripheral>CC_AES_S</alternatePeripheral>
      <headerStructName>CC_HASH</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_HASH</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>HASH_H[%s]</name>
          <description>Description collection: HASH_H value registers. The initial HASH_H[0] register holds the least significant bits [31:0] of the value.</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Write the initial hash value before start of digest operation, and read the final hash value result after 
          the digest operation has been completed.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_PAD_AUTO</name>
          <description>Configure the HASH engine to automatically pad data at the end of the DMA transfer to complete the digest operation.</description>
          <addressOffset>0x684</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HWPAD</name>
              <description>Enable automatic padding in hardware.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not enable automatic hardware padding.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable automatic hardware padding.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_INIT_STATE</name>
          <description>Configure HASH engine initial state registers.</description>
          <addressOffset>0x694</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Enable loading of data to initial state registers. Digest/IV for HASH/AES_MAC.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable loading of data to initial state registers.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable loading of data to initial state registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_VERSION</name>
          <description>HASH engine HW version</description>
          <addressOffset>0x7B0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PATCH</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>MINOR_VERSION_NUMBER</name>
              <description>Minor version number</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>MAJOR_VERSION_NUMBER</name>
              <description>Major version number</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_CONTROL</name>
          <description>Control the HASH engine behavior.</description>
          <addressOffset>0x7C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Select HASH mode to execute</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHA1</name>
                  <description>Select SHA1 mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA256</name>
                  <description>Select SHA256 mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA224</name>
                  <description>Select SHA224 mode</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_PAD</name>
          <description>Enable the hardware padding feature of the HASH engine.</description>
          <addressOffset>0x7C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Configure hardware padding feature.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable hardware padding feature.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable hardware padding feature.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_PAD_FORCE</name>
          <description>Force the hardware padding operation to trigger if the input data length is zero bytes.</description>
          <addressOffset>0x7C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Trigger hardware padding operation.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not force hardware padding to trigger.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Force hardware padding to trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_CUR_LEN_0</name>
          <description>Bits [31:0] of the number of bytes that have been digested so far.</description>
          <addressOffset>0x7CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Bits [31:0] of current length of digested data in bytes.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_CUR_LEN_1</name>
          <description>Bits [63:32] of the number of bytes that have been digested so far.</description>
          <addressOffset>0x7D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Bits [63:32] of current length of digested data in bytes.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_HW_FLAGS</name>
          <description>Hardware configuration of the HASH engine. Reset value holds the supported features.</description>
          <addressOffset>0x7DC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00012001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CW</name>
              <description>Indicates the number of concurrent words the hash is using to compute signature.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>One</name>
                  <description>One concurrent word used by hash during signature generation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Two</name>
                  <description>Two concurrent words used by hash during signature generation</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH</name>
              <description>Indicate if Hi adders are present for each Hi value or 1 adder is shared for all Hi.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>One</name>
                  <description>One Hi value is updated at a time.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>All</name>
                  <description>All Hi values are updated at the same time.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DW</name>
              <description>Determine the granularity of word size.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32Bits</name>
                  <description>32 bits word data.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64Bits</name>
                  <description>64 bits word data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHA_512_EXISTS</name>
              <description>If this flag is set, the engine include SHA-512 support.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>PAD_EXISTS</name>
              <description>If this flag is set, the engine include pad block support.</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>MD5_EXISTS</name>
              <description>If this flag is set, the engine include MD5 support.</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>HMAC_EXISTS</name>
              <description>If this flag is set, the engine include HMAC support.</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>SHA_256_EXISTS</name>
              <description>If this flag is set, the engine include SHA-256 support.</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>HASH_COMPARE_EXISTS</name>
              <description>If this flag is set, the engine include compare digest logic.</description>
              <lsb>17</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>DUMP_HASH_TO_DOUT_EXISTS</name>
              <description>If this flag is set, the engine include HASH to DOUT support.</description>
              <lsb>18</lsb>
              <msb>18</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_SW_RESET</name>
          <description>Reset the HASH engine.</description>
          <addressOffset>0x7E4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing any value to this address resets the HASH engine. The reset takes 4 CPU clock cycles to complete.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset HASH engine.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASH_ENDIANNESS</name>
          <description>Configure the endianness of HASH data and padding generation.</description>
          <addressOffset>0x7E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENDIAN</name>
              <description>Endianness of HASH data and padding generation. The default value is little-endian.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LittleEndian</name>
                  <description>Use little-endian format for data and padding</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BigEndian</name>
                  <description>Use big-endian format for data and padding</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
