NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_HOST_RGF_S</name>
      <description>CRYPTOCELL HOST register interface</description>
      <baseAddress>0x50841000</baseAddress>
      <alternatePeripheral>CC_AES_S</alternatePeripheral>
      <headerStructName>CC_HOST_RGF</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_HOST_RGF</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>IRR</name>
          <description>Interrupt request register. Each bit of this register holds the interrupt
        status of a single interrupt source. If corresponding IMR bit is
        unmasked, an interrupt is generated.</description>
          <addressOffset>0xA00</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM_TO_DIN_INT</name>
              <description>The RNG SRAM to DIN DMA done interrupt status. This interrupt is asserted when all data was delivered from RNG SRAM to DIN buffer.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>DOUT_TO_SRAM_INT</name>
              <description>The DOUT to RNG SRAM DMA done interrupt status. This interrupt is asserted when all data was delivered from DOUT buffer to RNG SRAM.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>MEM_TO_DIN_INT</name>
              <description>The memory to DIN DMA done interrupt status. This interrupt is asserted when all data was delivered from memory to DIN buffer.</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>DOUT_TO_MEM_INT</name>
              <description>The DOUT to memory DMA done interrupt status. This interrupt is asserted when all data was delivered from DOUT buffer to memory.</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AHB_ERR_INT</name>
              <description>The AHB error interrupt status.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>PKA_INT</name>
              <description>The PKA end of operation interrupt status.</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>RNG_INT</name>
              <description>The RNG interrupt status.</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt mask register. Each bit of this register holds the mask of a single interrupt source.</description>
          <addressOffset>0xA04</addressOffset>
          <access>read-write</access>
          <resetValue>0x01FFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM_TO_DIN_MASK</name>
              <description>The RNG SRAM to DIN DMA done interrupt mask.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask RNG SRAM to DIN DMA done interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask RNG SRAM to DIN DMA done interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOUT_TO_SRAM_MASK</name>
              <description>The DOUT to RNG SRAM DMA done interrupt mask.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask DOUT to RNG SRAM DMA done interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask DOUT to RNG SRAM DMA done interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEM_TO_DIN_MASK</name>
              <description>The memory to DIN DMA done interrupt mask.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask memory to DIN DMA done interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask memory to DIN DMA done interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOUT_TO_MEM_MASK</name>
              <description>The DOUT to memory DMA done interrupt mask.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask DOUT to memory DMA done interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask DOUT to memory DMA done interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_ERR_MASK</name>
              <description>The AHB error interrupt mask.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask AHB error interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask AHB error interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKA_MASK</name>
              <description>The PKA end of operation interrupt mask.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask PKA end of operation interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask PKA end of operation interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNG_MASK</name>
              <description>The RNG interrupt mask.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask RNG interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask RNG interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt clear register. Writing a 1 bit into a field in this register will clear the corresponding bit in IRR.</description>
          <addressOffset>0xA08</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM_TO_DIN_CLEAR</name>
              <description>The RNG SRAM to DIN DMA done interrupt clear.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>DOUT_TO_SRAM_CLEAR</name>
              <description>The DOUT to RNG SRAM DMA done interrupt clear.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>MEM_TO_DIN_CLEAR</name>
              <description>The memory to DIN DMA done interrupt clear.</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>DOUT_TO_MEM_CLEAR</name>
              <description>The DOUT to memory DMA done interrupt clear.</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AHB_ERR_CLEAR</name>
              <description>The AHB error interrupt clear.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>PKA_CLEAR</name>
              <description>The PKA end of operation interrupt clear.</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>RNG_CLEAR</name>
              <description>The RNG interrupt clear. Register RNG_ISR in the RNG engine must be cleared before this interrupt can be cleared.</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ENDIANNESS</name>
          <description>This register defines the endianness of the Host-accessible registers, and can only be written once.</description>
          <addressOffset>0xA0C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DOUT_WR_BG</name>
              <description>DOUT write endianness.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LittleEndian</name>
                  <description>Configure DOUT write as little-endian</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BigEndian</name>
                  <description>Configure DOUT write as big-endian</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN_RD_BG</name>
              <description>DIN read endianness.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LittleEndian</name>
                  <description>Configure DIN read as little-endian</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BigEndian</name>
                  <description>Configure DIN read as big-endian</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOUT_WR_WBG</name>
              <description>DOUT write word endianness.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LittleEndian</name>
                  <description>Configure DOUT write word as little-endian</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BigEndian</name>
                  <description>Configure DOUT write word as big-endian</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN_RD_WBG</name>
              <description>DIN read word endianness.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LittleEndian</name>
                  <description>Configure DIN read word as little-endian</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BigEndian</name>
                  <description>Configure DIN read word as big-endian</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_SIGNATURE</name>
          <description>This register holds the CRYPTOCELL subsystem signature. See reset value.</description>
          <addressOffset>0xA24</addressOffset>
          <access>read-only</access>
          <resetValue>0x20E00000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Fixed-value identification signature used by host driver to verify CRYPTOCELL presence at this address.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_BOOT</name>
          <description>Hardware configuration of the CRYPTOCELL subsystem. Reset value holds the supported features.</description>
          <addressOffset>0xA28</addressOffset>
          <access>read-only</access>
          <resetValue>0x4622982C</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>POWER_GATING_EXISTS_LOCAL</name>
              <description>If this flag is set, full power gating is implemented</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>LARGE_RKEK_LOCAL</name>
              <description>If this flag is set, large RKEK is supported</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>HASH_IN_FUSES_LOCAL</name>
              <description>If this flag is set, HASH in fuses is supported</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>EXT_MEM_SECURED_LOCAL</name>
              <description>If this flag is set, external secure memory is supported</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>RKEK_ECC_EXISTS_LOCAL_N</name>
              <description>If this flag is set, RKEK ECC is supported</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>SRAM_SIZE_LOCAL</name>
              <description>SRAM size</description>
              <lsb>6</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>DSCRPTR_EXISTS_LOCAL</name>
              <description>If this flag is set, Descriptors are supported</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>PAU_EXISTS_LOCAL</name>
              <description>If this flag is set, PAU is supported</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>RNG_EXISTS_LOCAL</name>
              <description>If this flag is set, the RNG engine is present</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>PKA_EXISTS_LOCAL</name>
              <description>If this flag is set, the PKA engine is present</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>RC4_EXISTS_LOCAL</name>
              <description>If this flag is set, the RC4 engine is present</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>SHA_512_PRSNT_LOCAL</name>
              <description>If this flag is set, the HASH engine supports SHA512</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>SHA_256_PRSNT_LOCAL</name>
              <description>If this flag is set, the HASH engine supports SHA256</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>MD5_PRSNT_LOCAL</name>
              <description>If this flag is set, the HASH engine supports MD5</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>HASH_EXISTS_LOCAL</name>
              <description>If this flag is set, the HASH engine is present</description>
              <lsb>17</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>C2_EXISTS_LOCAL</name>
              <description>If this flag is set, the C2 engine is present</description>
              <lsb>18</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>DES_EXISTS_LOCAL</name>
              <description>If this flag is set, the DES engine is present</description>
              <lsb>19</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>AES_XCBC_MAC_EXISTS_LOCAL</name>
              <description>If this flag is set, AES XCBC-MAC mode is supported</description>
              <lsb>20</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>AES_CMAC_EXISTS_LOCAL</name>
              <description>If this flag is set, AES CMAC mode is supported</description>
              <lsb>21</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>AES_CCM_EXISTS_LOCAL</name>
              <description>If this flag is set, AES CCM mode is supported</description>
              <lsb>22</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>AES_XEX_HW_T_CALC_LOCAL</name>
              <description>If this flag is set, AES XEX mode T-value calculation in HW is supported</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>AES_XEX_EXISTS_LOCAL</name>
              <description>If this flag is set, AES XEX mode is supported</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>CTR_EXISTS_LOCAL</name>
              <description>If this flag is set, AES CTR mode is supported</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>AES_DIN_BYTE_RESOLUTION_LOCAL</name>
              <description>If this flag is set, the AES engine data input support byte size resolution</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>TUNNELING_ENB_LOCAL</name>
              <description>If this flag is set, the AES engine supports tunneling operations</description>
              <lsb>27</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>SUPPORT_256_192_KEY_LOCAL</name>
              <description>If this flag is set, the AES engine supports 192/256 bits key sizes</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>ONLY_ENCRYPT_LOCAL</name>
              <description>If this flag is set, the AES engine only support encryption</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>AES_EXISTS_LOCAL</name>
              <description>If this flag is set, the AES engine is present</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_CRYPTOKEY_SEL</name>
          <description>AES hardware key select.</description>
          <addressOffset>0xA38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOST_CRYPTOKEY_SEL</name>
              <description>Select the source of the HW key that is used by the AES engine</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K_DR</name>
                  <description>Use device root key K_DR from CRYPTOCELL AO power domain</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K_PRTL</name>
                  <description>Use hard-coded RTL key K_PRTL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Session</name>
                  <description>Use provided session key</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
