NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
        <register>
          <name>HOST_IOT_KPRTL_LOCK</name>
          <description>This write-once register is the K_PRTL lock register. When this register is set, K_PRTL cannot be used and a zeroed key will be used instead. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
          <addressOffset>0xA4C</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOST_IOT_KPRTL_LOCK</name>
              <description>This register is the K_PRTL lock register. When this register is set, K_PRTL cannot be used and a zeroed key will be used instead. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>K_PRTL can be selected for use from register HOST_CRYPTOKEY_SEL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>K_PRTL has been locked until next power-on reset (POR). If K_PRTL is selected anyway, a zeroed key will be used instead.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_KDR0</name>
          <description>This register holds bits 31:0 of K_DR. The value of this register is saved in the CRYPTOCELL AO power domain. Reading from this address returns the K_DR valid status indicating if K_DR is successfully retained.</description>
          <addressOffset>0xA50</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOST_IOT_KDR0</name>
              <description>This register holds bits 31:0 of K_DR. The value of this register is saved in the CRYPTOCELL AO power domain. Reading from this address returns the K_DR valid status indicating if K_DR is successfully retained. Write: K_DR bits 31:0.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRetained</name>
                  <description>Read: 128 bits K_DR key value is not yet retained in the CRYPTOCELL AO power domain.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: 128 bits K_DR key value is successfully retained in the CRYPTOCELL AO power domain.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_KDR1</name>
          <description>This register holds bits 63:32 of K_DR. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
          <addressOffset>0xA54</addressOffset>
          <access>writeonce</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOST_IOT_KDR1</name>
              <description>K_DR bits 63:32</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_KDR2</name>
          <description>This register holds bits 95:64 of K_DR. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
          <addressOffset>0xA58</addressOffset>
          <access>writeonce</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOST_IOT_KDR2</name>
              <description>K_DR bits 95:64</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_KDR3</name>
          <description>This register holds bits 127:96 of K_DR. The value of this register is saved in the CRYPTOCELL AO power domain.</description>
          <addressOffset>0xA5C</addressOffset>
          <access>writeonce</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOST_IOT_KDR3</name>
              <description>K_DR bits 127:96</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_IOT_LCS</name>
          <description>Controls life-cycle state (LCS) for CRYPTOCELL subsystem</description>
          <addressOffset>0xA60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LCS</name>
              <description>Life-cycle state value. This field is write-once per reset.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-writeonce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DebugEnable</name>
                  <description>CC310 operates in debug mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Secure</name>
                  <description>CC310 operates in secure mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCS_IS_VALID</name>
              <description>Read-only field. Indicates if CRYPTOCELL LCS has been successfully configured since last reset.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Invalid</name>
                  <description>Valid LCS not yet retained in the CRYPTOCELL AO power domain</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>Valid LCS successfully retained in the CRYPTOCELL AO power domain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
