NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_PKA_S</name>
      <description>CRYPTOCELL PKA engine</description>
      <baseAddress>0x50841000</baseAddress>
      <alternatePeripheral>CC_AES_S</alternatePeripheral>
      <headerStructName>CC_PKA</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_PKA</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MEMORY_MAP[%s]</name>
          <description>Description collection: Register for mapping the virtual register R[n] to a physical address in the PKA SRAM.</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>The physical word address used for the virtual register.</description>
              <lsb>1</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OPCODE</name>
          <description>Operation code to be executed by the PKA engine. Writing to this register triggers the PKA operation.</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TAG</name>
              <description>Holds the operation tag or the operand C virtual register index.</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>REG_R</name>
              <description>Result register virtual register index.</description>
              <lsb>6</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>DISCARD_R</name>
              <description>This field controls the interpretation of REG_R.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Register</name>
                  <description>REG_R is intepreted as a register index.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Discard</name>
                  <description>Result is discarded.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG_B</name>
              <description>Operand B virtual register index.</description>
              <lsb>12</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>CONST_B</name>
              <description>This field controls the interpretation of REG_B.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Register</name>
                  <description>REG_B is intepreted as a register index.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Constant</name>
                  <description>REG_B is intepreted as a constant.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG_A</name>
              <description>Operand A virtual register index.</description>
              <lsb>18</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>CONST_A</name>
              <description>This field controls the interpretation of REG_A.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Register</name>
                  <description>REG_A is intepreted as a register index.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Constant</name>
                  <description>REG_A is intepreted as a constant.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEN</name>
              <description>The length of the operands. This value serves as an PKA length register index. E.g.: if LEN field value is set to 0, PKA_L[0] holds the size of the operands.</description>
              <lsb>24</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>OPCODE</name>
              <description>Operation code to be executed by the PKA engine</description>
              <lsb>27</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Terminate</name>
                  <description>Terminate operation</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AddInc</name>
                  <description>Add or Increment</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SubDecNeg</name>
                  <description>Subtract, Decrement, or Negate</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModAddInc</name>
                  <description>Modular Add or Modular Increment</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModSubDecNeg</name>
                  <description>Modular Subtract, Modular Decrement, or Modular Negate</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANDTST0CLR0</name>
                  <description>Perform AND, test, or clear</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ORCOPYSET0</name>
                  <description>Perform OR, copy, or set bits</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XORFLP0INVCMP</name>
                  <description>Perform XOR, flip bits, invert, or compare</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHR0</name>
                  <description>Shift right 0 operation</description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHR1</name>
                  <description>Shift right 1 operation</description>
                  <value>0x0D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHL0</name>
                  <description>Shift left 0 operation</description>
                  <value>0x0E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHL1</name>
                  <description>Shift left 1 operation</description>
                  <value>0x0F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MulLow</name>
                  <description>Multiply low operation</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModMul</name>
                  <description>Modular multiply operation</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModMulN</name>
                  <description>Modular multiply N operation</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModExp</name>
                  <description>Modular exponentiation operation</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Division</name>
                  <description>Division operation</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModInv</name>
                  <description>Modular inversion operation</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModDiv</name>
                  <description>Modular division operation</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MulHigh</name>
                  <description>Multiply high operation</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModMLAC</name>
                  <description>Modular multiplication acceleration</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModMLACNR</name>
                  <description>Modular multiplication acceleration where final reduction is omitted</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reduction</name>
                  <description>Reduction operation</description>
                  <value>0x1B</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>N_NP_T0_T1_ADDR</name>
          <description>This register defines the N, Np, T0, and T1 virtual register index.</description>
          <addressOffset>0x84</addressOffset>
          <access>read-write</access>
          <resetValue>0x000FF820</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>N_VIRTUAL_ADDR</name>
              <description>Register N virtual register index. Default is R0.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>NP_VIRTUAL_ADDR</name>
              <description>Register Np virtual register index. Default is R1.</description>
              <lsb>5</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>T0_VIRTUAL_ADDR</name>
              <description>Temporary register 0 virtual register index. Default is R30.</description>
              <lsb>10</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>T1_VIRTUAL_ADDR</name>
              <description>Temporary register 1 virtual register index. Default is R31.</description>
              <lsb>15</lsb>
              <msb>19</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_STATUS</name>
          <description>This register holds the status for the PKA pipeline.</description>
          <addressOffset>0x88</addressOffset>
          <access>read-only</access>
          <resetValue>0x00001000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALU_MSB_4BITS</name>
              <description>The most significant 4-bits of the operand updated in shift operation.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ALU_LSB_4BITS</name>
              <description>The least significant 4-bits of the operand updated in shift operation.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ALU_SIGN_OUT</name>
              <description>Indicates the MSB sign of the last operation.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>ALU_CARRY</name>
              <description>Holds the carry of the last ALU operation.</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>ALU_CARRY_MOD</name>
              <description>Holds the carry of the last modular operation.</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>ALU_SUB_IS_ZERO</name>
              <description>Indicates the last subtraction operation sign.</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>ALU_OUT_ZERO</name>
              <description>Indicates if the result of ALU OUT is zero.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>ALU_MODOVRFLW</name>
              <description>Modular overflow flag.</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>DIV_BY_ZERO</name>
              <description>Indication if the division is done by zero.</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>MODINV_OF_ZERO</name>
              <description>Indicates the modular inverse of zero.</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>OPCODE</name>
              <description>Opcode of the last operation</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_SW_RESET</name>
          <description>Reset the PKA engine.</description>
          <addressOffset>0x8C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing any value to this address resets the PKA engine. The reset takes 4 CPU clock cycles to complete.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset PKA engine.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PKA_L[%s]</name>
          <description>Description collection: This register holds the operands bit size.</description>
          <addressOffset>0x90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OpSize</name>
              <description>Operand bit size.</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_PIPE</name>
          <description>Status register indicating if the PKA pipeline is ready to receive a new OPCODE.</description>
          <addressOffset>0xB0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>PKA pipeline status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>PKA pipeline is not ready for a new OPCODE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>PKA pipeline is ready for a new OPCODE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_DONE</name>
          <description>Status register indicating if the PKA operation has been completed.</description>
          <addressOffset>0xB4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>PKA operation status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Processing</name>
                  <description>PKA operation is processing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Completed</name>
                  <description>PKA operation is completed and pipeline is empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_VERSION</name>
          <description>PKA engine HW version. Reset value holds the version.</description>
          <addressOffset>0xC4</addressOffset>
          <access>read-only</access>
          <resetValue>0x16110215</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PKA_VERSION</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_SRAM_WADDR</name>
          <description>Start address in PKA SRAM for subsequent write transactions.</description>
          <addressOffset>0xD4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>PKA SRAM start address for write transaction</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_SRAM_WDATA</name>
          <description>Write data to PKA SRAM. Writing to this register triggers a DMA transaction writing data into PKA SRAM. The DMA address offset is automatically incremented during write.</description>
          <addressOffset>0xD8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data to write to PKA SRAM.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_SRAM_RDATA</name>
          <description>Read data from PKA SRAM. Reading from this register triggers a DMA transaction read data from PKA SRAM. The DMA address offset is automatically incremented during read.</description>
          <addressOffset>0xDC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data to read from PKA SRAM</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_SRAM_WCLEAR</name>
          <description>Register for clearing PKA SRAM write buffer.</description>
          <addressOffset>0xE0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Clear the PKA SRAM write buffer.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_SRAM_RADDR</name>
          <description>Start address in PKA SRAM for subsequent read transactions.</description>
          <addressOffset>0xE4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>PKA SRAM start address for read transaction</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
