NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CC_RNG_S</name>
      <description>CRYPTOCELL RNG engine</description>
      <baseAddress>0x50841000</baseAddress>
      <alternatePeripheral>CC_AES_S</alternatePeripheral>
      <headerStructName>CC_RNG</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CC_RNG</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>RNG_IMR</name>
          <description>Interrupt mask register. Each bit of this register holds the mask of a single interrupt source.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EHR_VALID_MASK</name>
              <description>See RNG_ISR for explanation on this interrupt.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask EHR interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask EHR interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOCORR_ERR_MASK</name>
              <description>See RNG_ISR for explanation on this interrupt.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask autocorrelation interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask autocorrelation interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRNGT_ERR_MASK</name>
              <description>See RNG_ISR for explanation on this interrupt.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask the CRNGT error interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask the CRNGT error interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VNC_ERR_MASK</name>
              <description>See RNG_ISR for explanation on this interrupt.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask the von Neumann corrector error interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask the von Neumann corrector error interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WATCHDOG_MASK</name>
              <description>See RNG_ISR for explanation on this interrupt.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask the watchdog interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask the watchdog interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_MASK</name>
              <description>See RNG_ISR for explanation on this interrupt.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQEnable</name>
                  <description>Do not mask the RNG DMA completion interrupt i.e. interrupt is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQDisable</name>
                  <description>Mask the RNG DMA completion interrupt i.e. no interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_ISR</name>
          <description>Interrupt status register. Each bit of this register holds the interrupt
        status of a single interrupt source. If corresponding RNG_IMR bit is
        unmasked, an interrupt is generated.</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EHR_VALID_INT</name>
              <description>192-bits have been collected and are ready to be read.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AUTOCORR_ERR_INT</name>
              <description>Autocorrelation error. Failure occurs when autocorrelation test has failed four times in a row. Once set, the TRNG ceases to function until next reset.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CRNGT_ERR_INT</name>
              <description>Continuous random number generator test error. Failure occurs when two consecutive blocks of 16 collected bits are equal.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>VNC_ERR_INT</name>
              <description>von Neumann corrector error. Failure occurs if 32 consecutive collected bits are identical, ZERO, or ONE.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>WATCHDOG_INT</name>
              <description>Maximum number of CPU clock cycles per sample have been exceeded. See RNG_WATCHDOG_VAL for more information.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>DMA_DONE_INT</name>
              <description>RNG DMA to SRAM is completed.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_ICR</name>
          <description>Interrupt clear register. Writing a 1 bit into a field in this register
        will clear the corresponding bit in RNG_ISR.</description>
          <addressOffset>0x108</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EHR_VALID_CLEAR</name>
              <description>Writing value '1' clears corresponding bit in RNG_ISR</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AUTOCORR_ERR_CLEAR</name>
              <description>Cannot be cleared by software! Only RNG reset clears this bit.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CRNGT_ERR_CLEAR</name>
              <description>Writing value '1' clears corresponding bit in RNG_ISR</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>VNC_ERR_CLEAR</name>
              <description>Writing value '1' clears corresponding bit in RNG_ISR</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>WATCHDOG_CLEAR</name>
              <description>Writing value '1' clears corresponding bit in RNG_ISR</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>DMA_DONE_CLEAR</name>
              <description>Writing value '1' clears corresponding bit in RNG_ISR</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_CONFIG</name>
          <description>TRNG ring oscillator length configuration</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ROSC_LEN</name>
              <description>Set the length of the oscillator ring (= the number of inverters) out of four possible configurations.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROSC1</name>
                  <description>Use shortest ROSC1 ring oscillator configuration.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROSC2</name>
                  <description>Use ROSC2 ring oscillator configuration.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROSC3</name>
                  <description>Use ROSC3 ring oscillator configuration.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROSC4</name>
                  <description>Use longest ROSC4 ring oscillator configuration.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_VALID</name>
          <description>This register indicates if TRNG entropy collection is valid.</description>
          <addressOffset>0x110</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EHR_DATA</name>
              <description>A value of 1 indicates that collection of bits in the TRNG is completed, and data can be read from EHR_DATA registers.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotValid</name>
                  <description>Collection of bits not valid.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>Collection of bits valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EHR_DATA[%s]</name>
          <description>Description collection: The entropy holding registers (EHR) hold 192-bits random data collected by the TRNG. The initial EHR_DATA[0] register holds the least significant bits [31:0] of the random data value.</description>
          <addressOffset>0x114</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Random data value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOISE_SOURCE</name>
          <description>This register controls the ring oscillator circuit used as a noise source.</description>
          <addressOffset>0x12C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable the noise source.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Noise source is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Noise source is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLE_CNT</name>
          <description>Sample count defining the number of CPU clock cycles between two consecutive noise source samples.</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Number of CPU clock cycles between two consecutive noise source samples.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCORR_STATISTIC</name>
          <description>Statistics counter for autocorrelation test activations. Statistics collection is stopped if one of the counters reach its limit of all ones.</description>
          <addressOffset>0x134</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AUTOCORR_TRYS</name>
              <description>Count each time an autocorrelation test starts. Any write to the field resets the counter.</description>
              <lsb>0</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>AUTOCORR_FAILS</name>
              <description>Count each time an autocorrelation test fails. Any write to the field resets the counter.</description>
              <lsb>14</lsb>
              <msb>21</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_DEBUG</name>
          <description>Debug register for the TRNG. This register is used to bypass TRNG tests in hardware.</description>
          <addressOffset>0x138</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VNC_BYPASS</name>
              <description>Bypass the von Neumann corrector post-processing test, including the 32 consecutive bits test.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>von Neumann corrector post-processing is active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Bypass the von Neumann corrector</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRNGT_BYPASS</name>
              <description>Bypass the Continuous Random Number Generator Test (CRNGT).</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRNGT is active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Bypass CRNGT</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOCORR_BYPASS</name>
              <description>Bypass the autocorrelation test.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Autocorrelation test is active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Bypass the autocorrelation test</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_SW_RESET</name>
          <description>Reset the RNG engine.</description>
          <addressOffset>0x140</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing any value to this address resets the RNG engine. The reset takes 4 CPU clock cycles to complete.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset RNG engine.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_BUSY</name>
          <description>Status register for RNG engine activity.</description>
          <addressOffset>0x1B8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>RNG engine status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>RNG engine is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>RNG engine is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRNG_STATUS</name>
              <description>TRNG status.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>TRNG is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>TRNG is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_RESET</name>
          <description>Reset the TRNG, including internal counter of collected bits and registers EHR_DATA and TRNG_VALID.</description>
          <addressOffset>0x1BC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing any value to this address resets the internal bits counter and registers EHR_DATA and TRNG_VALID. Register NOISE_SOURCE must be disabled in order for the reset to take place.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Reset TRNG.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
