NordicSemiconductor/nrfx/bsp/stable/mdk/nrf9120.svd
        <register>
          <name>RNG_HW_FLAGS</name>
          <description>Hardware configuration of RNG engine. Reset value holds the supported features.</description>
          <addressOffset>0x1C0</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EHR_WIDTH</name>
              <description>Data width supported by the entropy collector</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128Bits</name>
                  <description>128 bits EHR width</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>192Bits</name>
                  <description>192 bits EHR width</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRNGT_EXISTS</name>
              <description>If this flag is set, the engine include support for continuous random number generator test.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>AUTOCORR_EXISTS</name>
              <description>If this flag is set, the engine include support for autocorrelation test.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>BYPASS_EXISTS</name>
              <description>If this flag is set, the engine include support for bypassing TRNG tests.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>PRNG_EXISTS</name>
              <description>If this flag is set, the engine include a pseudo-random number generator.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>KAT_EXISTS</name>
              <description>If this flag is set, the engine include support for known answer tests.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>RESEEDING_EXISTS</name>
              <description>If this flag is set, the engine include support for automatic reseeding.</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>RNG_USE_5_SBOXES</name>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>20 SBOX AES</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>5 SBOX AES</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_CLK</name>
          <description>Control clock for the RNG engine.</description>
          <addressOffset>0x1C4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables clock for the RNG engine.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable clock for RNG engine.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable clock for RNG engine.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DMA</name>
          <description>Writing to this register enables the RNG DMA engine.</description>
          <addressOffset>0x1C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable RNG DMA engine</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable RNG DMA engine This value is cleared when the RNG DMA engine completes its operation.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DMA_ROSC_LEN</name>
          <description>This register defines which ring oscillator length configuration should be used when using the RNG DMA engine.</description>
          <addressOffset>0x1CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ROSC1</name>
              <description>Use shortest ROSC1 ring oscillator configuration.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable ROSC1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable ROSC1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROSC2</name>
              <description>Use ROSC2 ring oscillator configuration.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable ROSC2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable ROSC2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROSC3</name>
              <description>Use ROSC3 ring oscillator configuration.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable ROSC3</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable ROSC3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROSC4</name>
              <description>Use longest ROSC4 ring oscillator configuration.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable ROSC4</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable ROSC4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DMA_SRAM_ADDR</name>
          <description>This register defines the start address in TRNG SRAM for the TRNG data to be collected by the RNG DMA engine.</description>
          <addressOffset>0x1D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNG_SRAM_DMA_ADDR</name>
              <description>Start address of the TRNG data in TRNG SRAM.</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DMA_SAMPLES_NUM</name>
          <description>This register defines the number of 192-bits samples that the RNG DMA engine collects per run.</description>
          <addressOffset>0x1D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNG_SAMPLES_NUM</name>
              <description>Defines the number of 192-bits samples that the DMA engine collects per run.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_WATCHDOG_VAL</name>
          <description>This register defines the maximum number of CPU clock cycles per TRNG collection of 192-bits samples. If the number of cycles for a collection exceeds this threshold the WATCHDOG interrupt is triggered.</description>
          <addressOffset>0x1D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNG_WATCHDOG_VAL</name>
              <description>Defines the maximum number of CPU clock cycles per TRNG collection of 192-bits samples. If the number of cycles for a collection exceeds this threshold the WATCHDOG interrupt is triggered.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DMA_BUSY</name>
          <description>Status register for RNG DMA engine activity.</description>
          <addressOffset>0x1DC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>RNG DMA engine status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>RNG DMA engine is idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>RNG DMA engine is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROSC_LEN</name>
              <description>The active ring oscillator length configuration used by the RNG DMA engine.</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROSC1</name>
                  <description>Shortest ROSC1 ring oscillator configuration used.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROSC2</name>
                  <description>ROSC2 ring oscillator configuration used.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROSC3</name>
                  <description>ROSC3 ring oscillator configuration used.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROSC4</name>
                  <description>Longest ROSC4 ring oscillator configuration used.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUM_OF_SAMPLES</name>
              <description>Number of samples already collected using the current ring oscillator configuration.</description>
              <lsb>3</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
